[net]
batch=1
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=15
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[quantize_convolutional]
batch_normalize=1
filters=24
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[quantize_convolutional]
batch_normalize=1
filters=30
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[quantize_convolutional]
batch_normalize=1
filters=54
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[quantize_convolutional]
batch_normalize=1
filters=92
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[quantize_convolutional]
batch_normalize=1
filters=69
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[quantize_convolutional]
batch_normalize=1
filters=70
size=3
stride=1
pad=1
activation=leaky

[quantize_convolutional]
batch_normalize=1
filters=18
size=1
stride=1
pad=1
activation=leaky

[quantize_convolutional]
batch_normalize=1
filters=36
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=0
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask=3,4,5
anchors=10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=1
num=6
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=-4

[quantize_convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 8

[quantize_convolutional]
batch_normalize=1
filters=51
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=0
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask=0,1,2
anchors=10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=1
num=6
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

